/* 
--- Знайти суму та кількість позитивних елементів.
--- Знайти максимальний елемент масиву та його порядковий номер.
--- Визначити кількість негативних елементів.
--- Знайти кількість непарних позитивних елементів.
--- Визначити кількість парних позитивних елементів.
--- Знайти суму парних позитивних елементів.
--- Знайти суму непарних позитивних елементів.
--- Знайти добуток позитивних елементів. 
*/
const numbers = [16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4, 47]
